# DimNotModifiable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimNotModifiable Property
ParameterTypeId Class See Also
---
"Non-modifiable"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimNotModifiable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimNotModifiable As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimNotModifiable {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace